## Staging: web
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 14 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                          NAME                                           |
|--------|-----------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.cra_upd_cloudfront_acm`                                            |
|        | `aws_acm_certificate_validation.cra_upd_cert_validation`                                |
|        | `aws_cloudfront_cache_policy.cra_upd_api_cache_policy`                                  |
|        | `aws_cloudfront_cache_policy.cra_upd_s3_cache_policy`                                   |
|        | `aws_cloudfront_distribution.cra_upd_cf_distribution`                                   |
|        | `aws_cloudfront_function.cra_upd_cf_viewer_request_function`                            |
|        | `aws_cloudfront_origin_access_identity.origin_access_identity`                          |
|        | `aws_route53_record.cra_upd_cert_validation_record[&quot;*.cra-arc.staging.cdssandbox.xyz&quot;]` |
|        | `aws_route53_record.cra_upd_cert_validation_record[&quot;cra-arc.staging.cdssandbox.xyz&quot;]`   |
|        | `aws_route53_record.cra_upd_cloudfront_alias`                                           |
|        | `aws_route53_zone.cra_upd_hosted_zone`                                                  |
|        | `aws_s3_bucket_policy.cra_upd_web_bucket_policy`                                        |
|        | `aws_wafv2_ip_set.cra_upd_waf_ip_set`                                                   |
|        | `aws_wafv2_web_acl.cra_upd_waf_acl`                                                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cra_upd_web_bucket_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cra_upd_web_bucket_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "/*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.cra_upd_cloudfront_acm will be created
  + resource "aws_acm_certificate" "cra_upd_cloudfront_acm" {
      + arn                       = (known after apply)
      + domain_name               = "cra-arc.staging.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.cra-arc.staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "cra-arc.staging.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.cra-arc.staging.cdssandbox.xyz",
          + "cra-arc.staging.cdssandbox.xyz",
        ]
      + tags_all                  = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.cra_upd_cert_validation will be created
  + resource "aws_acm_certificate_validation" "cra_upd_cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_cache_policy.cra_upd_api_cache_policy will be created
  + resource "aws_cloudfront_cache_policy" "cra_upd_api_cache_policy" {
      + arn         = (known after apply)
      + comment     = "The cache policy for the API Gateway origin"
      + default_ttl = 120
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 1
      + name        = "cra_upd_api_cache_policy"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = false
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_cache_policy.cra_upd_s3_cache_policy will be created
  + resource "aws_cloudfront_cache_policy" "cra_upd_s3_cache_policy" {
      + arn         = (known after apply)
      + comment     = "The cache policy for the S3 web bucket origin"
      + default_ttl = 300
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 1200
      + min_ttl     = 1
      + name        = "cra_upd_s3_cache_policy"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_distribution.cra_upd_cf_distribution will be created
  + resource "aws_cloudfront_distribution" "cra_upd_cf_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true
      + web_acl_id                      = (known after apply)

      + default_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id          = (known after apply)
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = true
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + target_origin_id         = "upd_web"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

          + grpc_config (known after apply)
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id            = (known after apply)
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = "b689b0a8-53d0-40ab-baf2-68738e2966ac"
          + path_pattern               = "/api/*"
          + response_headers_policy_id = "5cc3b908-e619-4b99-88e5-2cf7f45965bd"
          + target_origin_id           = "upd_api"
          + viewer_protocol_policy     = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + origin_id                = "upd_api"
            # (3 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + origin_id                = "upd_web"
            # (3 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_function.cra_upd_cf_viewer_request_function will be created
  + resource "aws_cloudfront_function" "cra_upd_cf_viewer_request_function" {
      + arn             = (known after apply)
      + code            = <<-EOT
            /*
             * Cloudfront function to rewrite URLs for SPA routing.
             */
            
            var fileRegex = /^\/.+(\.\w+$)/; // matches paths requesting a file. e.g.: /route1/my-font.woff2
            
            function handler(event) {
              var request = event.request;
            
              if (!fileRegex.test(request.uri)) {
                request.uri = '/index.html';
              }
            
              return request;
            }
        EOT
      + comment         = "Rewrites URLs to enable SPA routing"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "url-rewrite-function"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # aws_cloudfront_origin_access_identity.origin_access_identity will be created
  + resource "aws_cloudfront_origin_access_identity" "origin_access_identity" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Cloudfront origin access identity"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_route53_record.cra_upd_cert_validation_record["*.cra-arc.staging.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cra_upd_cert_validation_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.cra_upd_cert_validation_record["cra-arc.staging.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "cra_upd_cert_validation_record" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_record.cra_upd_cloudfront_alias will be created
  + resource "aws_route53_record" "cra_upd_cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "cra-arc.staging.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_zone.cra_upd_hosted_zone will be created
  + resource "aws_route53_zone" "cra_upd_hosted_zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "cra-arc.staging.cdssandbox.xyz"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + zone_id             = (known after apply)
    }

  # aws_s3_bucket_policy.cra_upd_web_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "cra_upd_web_bucket_policy" {
      + id     = (known after apply)
      + policy = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_ip_set.cra_upd_waf_ip_set will be created
  + resource "aws_wafv2_ip_set" "cra_upd_waf_ip_set" {
      + addresses          = [
          + "198.103.184.76/32",
        ]
      + arn                = (known after apply)
      + description        = "CRA UPD IP address allow list"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "cra-upd-waf-ip-set"
      + name_prefix        = (known after apply)
      + scope              = "CLOUDFRONT"
      + tags_all           = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
    }

  # aws_wafv2_web_acl.cra_upd_waf_acl will be created
  + resource "aws_wafv2_web_acl" "cra_upd_waf_acl" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "Block access from IPs not on the allowlist"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "cra-upd-cloudfront-waf-acl"
      + name_prefix                 = (known after apply)
      + scope                       = "CLOUDFRONT"
      + tags_all                    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "AllowIpsFromAllowlist"
          + priority = 1

          + action {
              + allow {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "cra-upd-waf-cloudfront-allow-ips"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "cra-upd-waf-cloudfront-block-traffic"
          + sampled_requests_enabled   = true
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudfront_distribution_domain_name = (known after apply)
  + distribution_id                     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.cra_upd_cloudfront_acm"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.cra_upd_cf_distribution"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cra_upd_hosted_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.cra_upd_waf_ip_set"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.cra_upd_waf_acl"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
